In [1]:
import pandas as pd

In [4]:
df = pd.read_csv(r"C:\Users\Seyy_\OneDrive\Desktop\jupyter projects\alex the analyst bootcamp\python\Worlds Telecom file.csv")

df

    Rank           Company Total revenue(US$ billion)        Country
0      1      China Mobile                  $140.5[1]          China
1      2           Verizon                    $134[2]  United States
2      3              AT&T                  $122.4[3]  United States
3      4           Comcast                  $121.6[4]  United States
4      5  Deutsche Telekom                  $120.7[5]        Germany
..   ...               ...                        ...            ...
84    85     Algar Telecom                   $1.1[85]         Brazil
85    86         Cable One                   $1.7[86]  United States
86    87          Mediacom                   $1.1[87]  United States
87    88            Vonage                   $1.0[88]  United States
88    89            Cell C                   $1.0[89]   South Africa

[89 rows x 4 columns]

In [6]:
df.set_index('Rank')

               Company Total revenue(US$ billion)        Country
Rank
1         China Mobile                  $140.5[1]          China
2              Verizon                    $134[2]  United States
3                 AT&T                  $122.4[3]  United States
4              Comcast                  $121.6[4]  United States
5     Deutsche Telekom                  $120.7[5]        Germany
...                ...                        ...            ...
85       Algar Telecom                   $1.1[85]         Brazil
86           Cable One                   $1.7[86]  United States
87            Mediacom                   $1.1[87]  United States
88              Vonage                   $1.0[88]  United States
89              Cell C                   $1.0[89]   South Africa

[89 rows x 3 columns]

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 89 entries, 0 to 88
Data columns (total 4 columns):
 #   Column                      Non-Null Count  Dtype
---  ------                      --------------  -----
 0   Rank                        89 non-null     int64
 1   Company                     89 non-null     object
 2   Total revenue(US$ billion)  89 non-null     object
 3   Country                     89 non-null     object
dtypes: int64(1), object(3)
memory usage: 2.9+ KB

In [9]:
df.shape

(89, 4)

In [11]:
df.head(8)

,Rank,Company,Total revenue(US$ billion),Country
0,1,China Mobile,$140.5[1],China
1,2,Verizon,$134[2],United States
2,3,AT&T,$122.4[3],United States
3,4,Comcast,$121.6[4],United States
4,5,Deutsche Telekom,$120.7[5],Germany
5,6,Nippon Telegraph and Telephone,$97.4[6],Japan
6,7,China Telecom,$70.3[7],China
7,8,SoftBank,$55.2[8],Japan

In [12]:
df.tail(8)

,Rank,Company,Total revenue(US$ billion),Country
81,82,Eir,$1.3[82],Ireland
82,83,Vocus Group,$1.3[83],Australia
83,84,Consolidated Communications,$1.2[84],United States
84,85,Algar Telecom,$1.1[85],Brazil
85,86,Cable One,$1.7[86],United States
86,87,Mediacom,$1.1[87],United States
87,88,Vonage,$1.0[88],United States
88,89,Cell C,$1.0[89],South Africa

In [18]:
df.loc[83]

Rank                                                   84
Company                       Consolidated Communications
Total revenue(US$ billion)                       $1.2[84]
Country                                     United States
Name: 83, dtype: object

In [20]:
df.iloc[12]

Rank                                     13
Company                       América Móvil
Total revenue(US$ billion)        $43.6[13]
Country                              Mexico
Name: 12, dtype: object

In [25]:
df.loc[df['Country'] == 'Ireland']

    Rank Company Total revenue(US$ billion)  Country
81    82     Eir                   $1.3[82]  Ireland

In [28]:
df.iloc[:, [0,2]]

    Rank Total revenue(US$ billion)
0      1                  $140.5[1]
1      2                    $134[2]
2      3                  $122.4[3]
3      4                  $121.6[4]
4      5                  $120.7[5]
..   ...                        ...
84    85                   $1.1[85]
85    86                   $1.7[86]
86    87                   $1.1[87]
87    88                   $1.0[88]
88    89                   $1.0[89]

[89 rows x 2 columns]

In [29]:
df.loc[df['Country'] != 'United States']

,Rank,Company,Total revenue(US$ billion),Country
0,1,China Mobile,$140.5[1],China
4,5,Deutsche Telekom,$120.7[5],Germany
5,6,Nippon Telegraph and Telephone,$97.4[6],Japan
6,7,China Telecom,$70.3[7],China
7,8,SoftBank,$55.2[8],Japan
...,...,...,...,...
77,78,Digi Communications,$1.7[78],Romania
81,82,Eir,$1.3[82],Ireland
82,83,Vocus Group,$1.3[83],Australia
84,85,Algar Telecom,$1.1[85],Brazil
88,89,Cell C,$1.0[89],South Africa

In [30]:
df.loc[:, 'Rank':'Country']

    Rank           Company Total revenue(US$ billion)        Country
0      1      China Mobile                  $140.5[1]          China
1      2           Verizon                    $134[2]  United States
2      3              AT&T                  $122.4[3]  United States
3      4           Comcast                  $121.6[4]  United States
4      5  Deutsche Telekom                  $120.7[5]        Germany
..   ...               ...                        ...            ...
84    85     Algar Telecom                   $1.1[85]         Brazil
85    86         Cable One                   $1.7[86]  United States
86    87          Mediacom                   $1.1[87]  United States
87    88            Vonage                   $1.0[88]  United States
88    89            Cell C                   $1.0[89]   South Africa

[89 rows x 4 columns]

In [33]:
df.iloc[1]

Rank                                      2
Company                             Verizon
Total revenue(US$ billion)          $134[2]
Country                       United States
Name: 1, dtype: object